Repository: gustavorodrii/GetItDone
Catalog: lib/l10n/app_*.arb
Languages: pt

# language
source: English
pt: Portuguese

# greeting
source: Hello,
pt: Olá,

# userName
source: User's name
pt: Nome do usuário

# newTask
source: Create a new task to organize your activities
pt: Crie uma nova tarefa para organizar suas atividades

# addTask
source: Create task
pt: Criar tarefa

# calendar
source: Clear filter
pt: Limpar filtro

# noTasks
source: How about starting to create your tasks and keeping your life organized?
pt: Que tal começar a criar as suas tarefas e manter a sua vida organizada?

# loadingData
source: We are loading your data, please wait a moment!
pt: Estamos carregando os seus dados, aguarde um instante por favor!

# taskTitle
source: Task name
pt: Nome da tarefa

source: Task description
pt: Descrição da tarefa

# taskNotification
source: Do you want to receive notifications?
pt: Deseja receber notificação?

# taskData
source: Date
pt: Data

# taskTime
source: Time
pt: Hora

# completedTasksHeader
source: You have {todoLength}
pt: Você tem {todoLength}

# taskCompletedText
source: completed tasks, {userName}!
pt: tarefas concluídas, {userName}!

# noTasksText
source: You haven't completed any tasks yet.
pt: Você ainda não concluiu nenhuma tarefa.

# calendarPrompt
source: Organize your routine and keep your tasks up to date.
pt: Organize sua rotina e mantenha suas tarefas em dia.

# clearFilterButton
source: Clear filter
pt: Limpar filtro

# loadingDataMessage
source: We are loading your data, please wait a moment!
pt: Estamos carregando seus dados, aguarde um instante por favor!

# deleteAllTasksButton
source: Delete all tasks
pt: Deletar todas as tarefas

source: Home
pt: Tarefas

source: Done
pt: Concluídas

# config
source: Profile
pt: Perfil

# welcomeMessage
source: Welcome to
pt: Seja bem-vindo ao

# inputEmailLogin
source: Enter your email
pt: Insira o seu e-mail

# inputNameLogin
source: Enter your name
pt: Insira o seu nome

# inputPasswordLogin
source: Enter your password
pt: Insira a sua senha

# registerButton
source: Register
pt: Registrar

# loginButton
source: Sign in
pt: Entrar

# alreadyHaveAccess
source: Sign in
pt: Já tenho acesso

source: Register
pt: Cadastrar

# registerMessage
source: Keep your day on track by quickly noting down your tasks!
pt: Organize seu dia com facilidade, anotando suas tarefas e mantendo tudo sob controle!

source: Success
pt: Sucesso

# registerSuccess
source: User registered successfully
pt: Usuário registrado com sucesso

# loginSuccess
source: Enjoy the app
pt: Aproveite o app

source: Error
pt: Erro

# errorMessage
source: Try again
pt: Tente novamente

# oldestList
source: Oldest first
pt: Mais antigas

# newestList
source: Newest first
pt: Mais recentes

# consecutiveDays
source: You’ve been creating tasks for {days} days. We’re proud!
pt: Você está há {days} dias criando tarefas. Estamos orgulhosos!

# consecutiveDay
source: You’ve been creating tasks for {days} day. We’re proud!
pt: Você está há {days} dia criando tarefas. Estamos orgulhosos!

# todoLengthMessage
source: Tasks pending
pt: Tarefas pendentes

# completedLengthMessage
source: Tasks completed
pt: Tarefas concluídas

source: Delete
pt: Excluir

# check
source: Done
pt: Feito

# uncheck
source: Undo
pt: Desfazer

# consecutiveDaysList
source: Here are the top 10 users of the app based on consecutive days active
pt: Aqui estão os 10 principais usuários do app com base nos dias consecutivos ativos

source: Sign Out
pt: Sair da Conta

# welcomePageMessage1
source: Never let your tasks get delayed or forget about them again
pt: Nunca mais deixe suas tarefas atrasadas ou esqueça delas!

# welcomePageMessage2
source: With the super app Get It Done, you'll be notified whenever a new task is created
pt: Com o super app Get It Done, você será notificado sempre que uma nova tarefa for criada.

# welcomePageMessage3
source: Our mission is to simplify your life with small daily steps. Keep track of your tasks and boost your productivity
pt: Nossa missão é simplificar sua vida com pequenos passos diários. Acompanhe suas tarefas e melhore sua produtividade!

# welcomePageMessageCreateTitle
source: Create your tasks
pt: Crie suas tarefas

# welcomePageMessageCreateDescription
source: Create your tasks simply and practically, without complications
pt: Crie suas tarefas de forma simples e prática, sem complicações.

# welcomePageMessageHomeTitle
source: Track your progress
pt: Acompanhe seu progresso

# welcomePageMessageHomeDescription
source: See all your tasks organized.
pt: Veja todas as suas tarefas organizadas.

# welcomePageMessageDoneTitle
source: Completed tasks
pt: Tarefas concluídas

# welcomePageMessageDoneDescription
source: Mark your tasks as completed and see your progress in real-time
pt: Marque suas tarefas como concluídas e veja seu progresso em tempo real.

# welcomePageMessageProfileDescription
source: See who the most engaged users are on consecutive days.
pt: Descubra os usuários mais engajados em dias consecutivos.

# goToApp
source: Take me to the app
pt: Me leve para o app

# welcomeToApp
source: Welcome to the family, {userName}
pt: Seja bem-vindo à família, {userName}
